app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "testuu"], ["text", "tbadel"], ["updated_at", "2015-07-29 04:18:43.660221"], ["id", 2]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)