app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "com1"], ["body", "this is comment"], ["article_id", 2], ["created_at", "2015-07-29 04:40:51.406840"], ["updated_at", "2015-07-29 04:40:51.406840"]]
---
def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)